wisteria-1c/Конфигурация/Catalogs/МаршрутыСогласованияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МаршрутыСогласованияЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СогласованиеЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СогласованиеЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийСогласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/МаршрутыСогласованияЗаявок/Forms/ФормаЭлементаДляЗаявки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		
		ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		
		ПараметрыСообщения.ТипСообщения = "Информация";
		ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Маршрут без участников'");
		ПараметрыСообщения.Сообщение = НСтр("ru = 'Данный маршрут позволяет автоматически утверждать заявки на расход денег и не содержит участников'");
		ПараметрыСообщения.Скрываемый = Ложь;
		
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
		ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
	КонецЕсли;
		
	ОбработатьТаблицуУчастникиМаршрута();
	        
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьТаблицуУчастникиМаршрута()
	
	ТекущийСогласующий = РегистрыСведений.СогласованиеЗаявок.ПолучитьТекущегоСогласующего(Параметры.ЗаявкаСсылка);
	
	ТаблицаУчастники = Объект.УчастникиМаршрута;
	
	СтрокаАвтор = ТаблицаУчастники.Вставить(0);
	СтрокаАвтор.Пользователь = Параметры.АвторЗаявки;
	СтрокаАвтор.СтатусСогласования = НСтр("ru='Автор'");
	СтрокаАвтор.ЕстьПравоУтвержденияВнеСогласования = Пользователи.РолиДоступны("УтверждениеЗаявокНаРасходДенегВОбходСогласования",
																				СтрокаАвтор.Пользователь);
	Если Параметры.ЗаявкаПроведена Тогда
		
		Если ЗначениеЗаполнено(ТекущийСогласующий) Тогда
			
			Отбор = Новый Структура("Пользователь", ТекущийСогласующий);   
			НайденныеСтроки = ТаблицаУчастники.НайтиСтроки(Отбор);
			СтрокаТекущийСогласующий = НайденныеСтроки[НайденныеСтроки.Количество() - 1];
			СтрокаТекущийСогласующий.СтатусСогласования = НСтр("ru='Текущий согласующий'");
			ИндексТекущийСогласующий = ТаблицаУчастники.Индекс(СтрокаТекущийСогласующий);
		
		Иначе
			
			ИндексТекущийСогласующий = ТаблицаУчастники.Количество();
	
		КонецЕсли;
		
	Иначе
		ИндексТекущийСогласующий = 0;
	КонецЕсли;
	
	Для ИндексСтроки = 1 По ТаблицаУчастники.Количество() - 1 Цикл
		
		Если ИндексСтроки < ИндексТекущийСогласующий Тогда
			
			ТаблицаУчастники[ИндексСтроки].СтатусСогласования = НСтр("ru='Согласовал'");
			
		ИначеЕсли ИндексСтроки > ИндексТекущийСогласующий Тогда 
			
			ТаблицаУчастники[ИндексСтроки].СтатусСогласования = НСтр("ru='К согласованию'");
			
		КонецЕсли;
		
		ТаблицаУчастники[ИндексСтроки].ЕстьПравоУтвержденияВнеСогласования = Пользователи.РолиДоступны("УтверждениеЗаявокНаРасходДенегВОбходСогласования",
																									   ТаблицаУчастники[ИндексСтроки].Пользователь);
		
	КонецЦикла;
	
	УстановитьУсловноеОформление(ИндексТекущийСогласующий)
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформление(ИндексТекущийСогласующий)
		
	УсловноеОформление.Элементы.Очистить();
        
    ЭлементОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Использование = Истина;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ЗаголовокЧетвертогоУровня);
    
    ЭлементУсловия                = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.УчастникиМаршрута.НомерСтроки");
    ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = ИндексТекущийСогласующий + 1;
    ЭлементУсловия.Использование  = Истина;
    
    ОформляемоеПоле      = ЭлементОформления.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("УчастникиМаршрута");
    
КонецПроцедуры

#КонецОбласти
